Repository: nguyenvananh0311/ACES_MobileApp
Catalog: lib/l10n/intl_*.arb
Languages: km

# title
source: Workplace
km: កន្លែងធ្វើការប្រាកដ

# attendanceTitle
source: Attendance
km: ការចុះឈ្មោះ

# attendanceSubtitle
source: Check in/Check out
km: ចូល / ចេញ

# leaveTitle
source: Leave
km: ការដាក់ច្បាប់

# leaveSubtitle
source: History and request leave
km: ប្រវត្តិ និងស្នើសុំដាក់ច្បាប់

# replaceTitle
source: Replacement
km: ការជំនួស

# replaceSubtitle
source: History and request replacement
km: ប្រវត្តិ និងស្នើសុំការជំនួស

# overtimeTitle
source: Overtime
km: ម៉ោងបន្ថែម

# overtimeSubtitle
source: History and request overtime
km: ស្នើរសុំ និងប្រវត្តិម៉ោងបន្ថែម

# calendarTitle
source: My Calendar
km: ប្រតិទិនរបស់ខ្ញុំ

# calendarSubtitle
source: Workday & Holiday
km: ថ្ងៃធ្វើការ និងថ្ងៃឈប់សម្រាក

# membersTitle
source: Members
km: សមាជិក

# membersSubtitle
source: List all members
km: បញ្ជីសមាជិកទាំងអស់

source: Attendance
km: វត្តមាន

source: Morning
km: ព្រឹក

source: Afternoon
km: ល្ងាច

source: Check-in
km: ចូល

source: Check-out
km: ចេញ

source: Cannot check in
km: មិនអាចចូលរួច

source: Unchecked
km: មិនបានចុះឈ្មោះ

source: Early
km: មុនពេល

source: Late
km: យឺត

source: Check
km: ពិនិត្យ

source: Attendance History
km: ប្រវត្តិវត្តមាន

source: Leave
km: សំរាក

source: Annual Leave
km: សំរាកប្រចាំឆ្នាំ

source: Replace Leave
km: សំរាកជំនួស

source: Unpaid
km: គ្មានប្រាក់ខែ

# no_data
source: No data available
km: គ្មានទិន្នន័យ

source: Pending
km: រង់ចាំ

source: Approved
km: បានអនុម័ត

source: Rejected
km: បានបដិសេធ

source: Loading...
km: កំពុងផ្ទុក...

# error
source: Error: {error}
km: កំហុស: {error}

source: Add Leave Request
km: បន្ថែមសំណើសុំសំរាក

source: Created Date
km: កាលបរិច្ឆេទបង្កើត

source: Status
km: ស្ថានភាព

source: Description
km: ការពិពណ៌នា

source: Duration
km: រយៈពេល

source: All
km: ទាំងអស់

source: Date
km: ថ្ងៃ

source: Reason
km: មូលហេតុ

source: Leave Request Detail
km: ព័ត៌មានលម្អិតអំពីការស្នើសុំឈប់

source: From
km: ពី

source: To
km: ទៅ

source: Total
km: សរុប

source: day(s)
km: ថ្ងៃ

# leaveType
source: Type of Leave
km: ប្រភេទការស្នើសុំឈប់

source: Phone number
km: លេខទូរស័ព្ទ

source: Approved by
km: អនុម័តដោយ

source: Comment
km: មតិយោបល់

source: CANCEL
km: បោះបង់

source: No data available
km: មិនមានទិន្នន័យ

source: Request Leave
km: សំណើសុំឈប់

source: Type of Leave
km: ប្រភេទការឈប់

source: No file selected
km: មិនមានឯកសារត្រូវបានជ្រើសរើស

# pleaseSelectStartBeforeEnd
source: Please select the start date before the end date
km: សូមជ្រើសរើសថ្ងៃចាប់ផ្តើមមុនថ្ងៃបញ្ចប់

# successLeaveRequest
source: Leave request added successfully
km: ការស្នើសុំឈប់បានបន្ថែមដោយជោគជ័យ

# errorLeaveRequest
source: Failed to add leave request
km: ការស្នើសុំឈប់បរាជ័យ

source: Canceled successfully
km: បានលុបដោយជោគជ័យ

source: Failed to cancel
km: មិនអាចលុប

# pleaseEnterPhoneNumber
source: Please enter your phone number
km: សូមបញ្ចូលលេខទូរស័ព្ទរបស់អ្នក

# pleaseEnterLeaveReason
source: Please enter your reason
km: សូមបញ្ចូលហេតុផល

source: Submit
km: ដាក់ស្នើ

# annualDayNotEnough
source: You have {remainingDays} annual day(s). Not enough to leave
km: អ្នកមាន {remainingDays} ថ្ងៃឈប់សម្រាប់ឆ្នាំនេះ។ មិនគ្រប់គ្រាន់សម្រាប់ការឈប់

# replaceDayNotEnough
source: You have {remainingDays} replace day(s). Not enough to leave
km: អ្នកមាន {remainingDays} ថ្ងៃប្តូរ។ មិនគ្រប់គ្រាន់ដើម្បីចេញទៅទេ

# reasonPlaceholder
source: Please write your reason here...
km: សូមសរសេរเหตุผลរបស់អ្នកនៅទីនេះ...

# replaceRequestTitle
source: Request Replace
km: ស្នើសុំប្តូរ

# dateErrorStart
source: Please select the start date after now
km: សូមជ្រើសរើសថ្ងៃចាប់ផ្តើមក្រោយពេលបច្ចុប្បន្ន

# dateErrorEnd
source: Please select the end date after now
km: សូមជ្រើសរើសថ្ងៃចុងក្រោយក្រោយពេលបច្ចុប្បន្ន

# dateErrorMonth
source: Please select a date range within the same month.
km: សូមជ្រើសរើសចន្លោះថ្ងៃនៅក្នុងខែតែមួយ។

# dateErrorBeforeEnd
source: Please select the start date before the end date
km: សូមជ្រើសរើសថ្ងៃចាប់ផ្តើមមុនថ្ងៃចុងក្រោយ

# dayOffErrorStart
source: This start date is not a day off
km: ថ្ងៃចាប់ផ្តើមនេះមិនមែនជាថ្ងៃសម្រាកទេ

# dayOffErrorEnd
source: This end date is not a day off
km: ថ្ងៃចុងក្រោយនេះមិនមែនជាថ្ងៃសម្រាកទេ

# totalDays
source: Total: {totalDays} day(s)
km: សរុប: {totalDays} ថ្ងៃ

# phoneNumberError
source: Please enter your phone number
km: សូមបញ្ចូលលេខទូរស័ព្ទរបស់អ្នក

# overtimeExceed
source: Overtime cannot exceed 12 hours
km: ម៉ោងលើសម៉ោងមិនអាចលើសពី 12 ម៉ោង

source: Request Overtime
km: ស្នើសុំម៉ោងបន្ថែម

# reasonError
source: Please enter your reason
km: សូមបញ្ចូលមូលហេតុរបស់អ្នក

# submitSuccess
source: Submit successfully
km: បន្ថែមដោយជោគជ័យ

source: Submit failure
km: បន្ថែមបរាជ័យ

# replace
source: Replacement
km: ជំនួស

source: Replace Request Detail
km: ស្នើសុំជំនួសលម្អិត

source: Overtime Request Detail
km: ស្នើសុំម៉ោងបន្ថែមលម្អិត

# alreadyCheckedOut
source: You have already checked out
km: អ្នកបានចេញហើយ

# checkinTimeOutsideOvertime
source: Check-in time is outside the overtime
km: ពេលវេលា Check-in គឺខុសពីម៉ោងបន្ថែម

source: Working Time
km: ម៉ោងធ្វើការ

source: Workday / Time
km: ថ្ងៃធ្វើការ / ម៉ោង

source: Holiday
km: ថ្ងៃឈប់សម្រាក

source: Day off
km: ថ្ងៃឈប់

source: Profile
km: ប្រវត្តិរូប

source: Logout
km: ចាកចេញ

source: Settings
km: ការកំណត់

source: Department
km: នាយកដ្ឋាន

source: Position
km: មុខតំណែង

source: Join At
km: ចូលរួមនៅ

source: Seniority
km: អតីតភាព

source: App Version
km: កំណែកម្មវិធី

source: Member
km: សមាជិក

source: year
km: ឆ្នាំ

source: years
km: ឆ្នាំ

source: month
km: ខែ

source: months
km: ខែ

source: day
km: ថ្ងៃ

source: QR Code Scanner
km: ឧបករណ៍ស្កេន QR កូដ

source: Code
km: កូដ

source: Scan a code
km: ស្កេនកូដ

source: Attendance successful!
km: ចូលរួមដោយជោគជ័យ!

source: Please try again or contact your manager.
km: សូមព្យាយាមម្តងទៀត ឬទាក់ទងអ្នកគ្រប់គ្រងរបស់អ្នក។

source: Failed to log in
km: បរាជ័យក្នុងការចូល

source: Scan QR code to login
km: ស្កេន QR កូដ ដើម្បីចូល

source: HOME
km: ទំព័រដើម

source: ME
km: ខ្ញុំ

source: Failed to add leave request:
km: បរាជ័យក្នុងការបន្ថែមសំណើចាកចេញ:

source: Log in successfully
km: ចូលដោយជោគជ័យ

source: Notification
km: ជូនដំណឹង

source: Mark all as read
km: ធ្វើការវាយស្នាមទាំងអស់ថាអានរួច

# noteTitle
source: Note
km: កំណត់ចំណាំ

# submitNotePrompt
source: Please submit your note before you scan
km: សូមដាក់កំណត់ចំណាំរបស់អ្នកមុនពេលស្កេន

# noteHint
source: Please write your note here...
km: សូមសរសេរកំណត់ចំណាំរបស់អ្នកនៅទីនេះ...

# sorryLate
source: Sorry I am late
km: សូមអភ័យទោស ខ្ញុំមកយឺត

source: I am sick
km: ខ្ញុំឈឺ

# doneButton
source: DONE
km: ធ្វើរួច

# skipButton
source: SKIP
km: រំលង

# errorTitle
source: Error
km: កំហុស

# locationError
source: You are not in the correct location to check-in.
km: អ្នកមិននៅក្នុងទីតាំងត្រឹមត្រូវដើម្បីចុះឈ្មោះ។

source: hour(s)
km: ម៉ោង

# ot_checkin_note
source: Please check in no later than 30 minutes before and no later than 1 hour after the registration time!
km: សូមធ្វើការចូលមុន 30 នាទីមុនពេលចុះឈ្មោះ និងមិនលើសពី 1 ម៉ោងបន្ទាប់ពីពេលចុះឈ្មោះ។

# upload_success
source: Upload successfully
km: ផ្ទុកឡើងដោយជោគជ័យ

source: Upload failed
km: ផ្ទុកឡើងបរាជ័យ

# haveRegisterRequest
source: You have registered a request at this time, please check again.
km: អ្នកបានចុះឈ្មោះសំណើនៅក្នុងពេលវេលានេះ សូមពិនិត្យម្តងទៀត។

# dayOffError
source: The day {date} is a day off
km: ថ្ងៃ {date} គឺជាថ្ងៃឈប់សម្រាក។

# notDayOffError
source: The day {date} is not a day off
km: ថ្ងៃ {date} មិនមែនជាថ្ងៃឈប់សម្រាកទេ។

source: Feedback
km: មតិយោបល់

source: Give Feedback
km: ផ្តល់មតិយោបល់

# write_feedback
source: Please write your feedback here...
km: សូមសរសេរ​មតិយោបល់​របស់​អ្នកនៅទីនេះ...

# write_recommendation
source: Please write your recommendation here...
km: សូមសរសេរ​សំណើ​របស់​អ្នកនៅទីនេះ...

# rate_experience
source: How would you rate your experience?
km: អ្នកនឹងតម្លៃបទពិសោធន៍របស់អ្នកយ៉ាងដូចម្តេច?

source: Recommendation
km: សំណើ

source: Confirm Logout
km: បញ្ជាក់ការចេញចូល

# logout_confirmation
source: Are you sure you want to logout? If you log out, you will need a QR code provided by your manager to log in again.
km: តើអ្នកប្រាកដថាលាចេញចូលឬទេ? បើអ្នកចេញចូល អ្នកត្រូវការម៉ូដ QR ដែលត្រូវបានផ្ដល់ដោយអ្នកគ្រប់គ្រងរបស់អ្នកដើម្បីចូលប្រើវិញ។

source: Yes
km: បាទ

source: No
km: ទេ

# location_dialog_title
source: Location Permission Denied
km: បានបដិសេធការអនុញ្ញាតទីតាំង

# location_dialog_content
source: You have permanently denied location access. Please enable the permission in system settings.
km: អ្នកបានបដិសេធការចូលដំណើរការទីតាំងយ៉ាងអចិន្រ្ដៃយ៍។ សូមបើកការអនុញ្ញាតនៅក្នុងការកំណត់ប្រព័ន្ធ។

source: Go to Settings
km: ទៅកាន់ការកំណត់

# cancel_lowercase
source: Cancel
km: បោះបង់
